#### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [2]:

!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-macosx_11_0_arm64.whl.metadata (89 kB)
Requirement already satisfied: numpy>=1.26.0 in /Users/mihirjadhav04/Desktop/Data Analyst Course - Udemy /Python/venv/lib/python3.12/site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/mihirjadhav04/Desktop/Data Analyst Course - Udemy /Python/venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Users/mihirjadhav04/Desktop/Data Analyst Course - Udemy /Python/venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp312-cp312-macosx_11_0_arm64.whl (11.4 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.4/11.4 MB 3.7 MB/s eta 0:00:0000:0100:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.2 tzdata-2025.2

In [3]:
import pandas as pd

In [4]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=["Mihir","Bhavin","Deep","Vivek","Pratik"]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0     Mihir
1    Bhavin
2      Deep
3     Vivek
4    Pratik
dtype: object
<class 'pandas.core.series.Series'>

In [6]:
## Create a Series from dictionary
data={'firstName':'Mihir','lastName':'Jadhav','age':25,'height':5.9,'weight':65,'isMarried':False}
seriesData = pd.Series(data)
print(seriesData)
print(type(seriesData))

firstName     Mihir
lastName     Jadhav
age              25
height          5.9
weight           65
isMarried     False
dtype: object
<class 'pandas.core.series.Series'>

In [7]:
data=["Mihir","Bhavin","Deep","Vivek","Pratik"]
index=["firstFriend","secondFriend","thirdFriend","fourthFriend","fifthFriend"]
pd.Series(data,index=index)

firstFriend      Mihir
secondFriend    Bhavin
thirdFriend       Deep
fourthFriend     Vivek
fifthFriend     Pratik
dtype: object

In [ ]:
## Dataframe
## create a Dataframe from a dictionary oof list

data={
    'Name':['Mihir','Bhavin','Vivek'],
    'Age':[25,30,45],
    'City':['Bangalore','Mumbai','Jaipur']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0   Mihir   25  Bangalore
1  Bhavin   30   New York
2   Vivek   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [22]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Mihir','Age':25,'City':'Mumbai'},
    {'Name':'Bhavin','Age':30,'City':'Jaipur'},
    {'Name':'Vivek','Age':45,'City':'Bangalore'},
    {'Name':'Pratik','Age':25,'City':'Delhi'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0   Mihir   25     Mumbai
1  Bhavin   30     Jaipur
2   Vivek   45  Bangalore
3  Pratik   25      Delhi
<class 'pandas.core.frame.DataFrame'>

In [17]:
data=pd.read_csv('data.csv')
data.head(10)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
5  2023-01-06        B   54.0  Product3  192.0   West
6  2023-01-07        A   16.0  Product1  936.0   East
7  2023-01-08        C   89.0  Product1  488.0   West
8  2023-01-09        C   37.0  Product3  772.0   West
9  2023-01-10        A   22.0  Product2  834.0   West

In [18]:
data.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [23]:
### Accessing Data From Dataframe
df

     Name  Age       City
0   Mihir   25     Mumbai
1  Bhavin   30     Jaipur
2   Vivek   45  Bangalore
3  Pratik   25      Delhi

In [24]:
df['Name']

0     Mihir
1    Bhavin
2     Vivek
3    Pratik
Name: Name, dtype: object

In [25]:
df.loc[0]

Name     Mihir
Age         25
City    Mumbai
Name: 0, dtype: object

In [30]:
df.iloc[0]

Name        Krish
Age            25
City    Bangalore
Name: 0, dtype: object

In [34]:
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida

In [27]:
## Accessing a specified element
df.at[1,'Age']

np.int64(30)

In [28]:
df.at[2,'Name']

'Vivek'

In [29]:
## Accessing a specified element using iat
df.iat[2,2]

'Bangalore'

In [30]:
df

     Name  Age       City
0   Mihir   25     Mumbai
1  Bhavin   30     Jaipur
2   Vivek   45  Bangalore
3  Pratik   25      Delhi

In [31]:
### Data MAnipulation with Dataframe
df

     Name  Age       City
0   Mihir   25     Mumbai
1  Bhavin   30     Jaipur
2   Vivek   45  Bangalore
3  Pratik   25      Delhi

In [33]:
## Adding a column
df['Salary']=[50000,60000,70000,80000]
df

     Name  Age       City  Salary
0   Mihir   25     Mumbai   50000
1  Bhavin   30     Jaipur   60000
2   Vivek   45  Bangalore   70000
3  Pratik   25      Delhi   80000

In [ ]:
## Remove a column 
## drop function
df.drop('Salary',axis=1,inplace=True)

In [35]:
df

     Name  Age       City
0   Mihir   25     Mumbai
1  Bhavin   30     Jaipur
2   Vivek   45  Bangalore
3  Pratik   25      Delhi

In [36]:
## Add age to the column
df['Age']=df['Age']+1
df

     Name  Age       City
0   Mihir   26     Mumbai
1  Bhavin   31     Jaipur
2   Vivek   46  Bangalore
3  Pratik   26      Delhi

In [37]:
df.drop(0,inplace=True)

In [38]:
df

     Name  Age       City
1  Bhavin   31     Jaipur
2   Vivek   46  Bangalore
3  Pratik   26      Delhi

In [41]:
df=pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [43]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object
Statistical summary:
            Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [55]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000